// © Copyright 2012-2015, 2017 HP Development Company, L.P.

TaskName = "HP Product Registration";
TaskTOCTitle = "Web Registration";

HSDRegistrationDescription = "The online registration process will start automatically and send most of the required information so that you can register your product quickly and easily when you finish setting it up. You will also be taken to the HP Connected website, the central place to manage your printing experience online.";

WarningSheetExtendedMessages = "After you click Continue, an HP Product Registration page will open in your default web browser. The following information will be sent to the HP website to expedite the registration process.";

HSDZipCodeTitle = "Zip Code:";
